---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidElevationAtTop
source: html/d01d0805-b2ad-ea4b-0548-375f19161fc2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidElevationAtTop Property

"Elevation at Top"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidElevationAtTop { get; }
```